In [1]:
#wrangle data
import warnings
warnings.filterwarnings('ignore')

from env import get_db_url
import pandas as pd
import numpy as np

### 1) Acquire customer_id, monthly_charges, tenure, and total_charges from telco_churn database for all customers with a 2 year contract.

In [2]:
url = get_db_url('telco_churn')
df = pd.read_sql('''
SELECT customer_id, monthly_charges, total_charges, tenure
FROM customers
where contract_type_id = 3
''', url)

In [3]:
df.head(5)

  customer_id  monthly_charges total_charges  tenure
0  0013-SMEOE           109.70       7904.25      71
1  0014-BMAQU            84.65        5377.8      63
2  0016-QLJIS            90.45        5957.9      65
3  0017-DINOC            45.20       2460.55      54
4  0017-IUDMW           116.80       8456.75      72

In [4]:
df.shape

(1695, 4)

In [5]:
df.describe()

       monthly_charges       tenure
count      1695.000000  1695.000000
mean         60.770413    56.735103
std          34.678865    18.209363
min          18.400000     0.000000
25%          24.025000    48.000000
50%          64.350000    64.000000
75%          90.450000    71.000000
max         118.750000    72.000000

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1695 non-null object
monthly_charges    1695 non-null float64
total_charges      1695 non-null object
tenure             1695 non-null int64
dtypes: float64(1), int64(1), object(2)
memory usage: 53.0+ KB

### 2) Walk through the steps above using your new dataframe. You may handle the missing values however you feel is appropriate.

In [7]:
# no null values
# total_charges may have some wrong data causing values to be object instead of floats

In [8]:
df.sort_values('total_charges').head(15)

     customer_id  monthly_charges total_charges  tenure
524   3213-VVOLG            25.35                     0
416   2520-SGTTA            20.00                     0
678   4075-WKNIU            73.35                     0
234   1371-DWPAZ            56.05                     0
941   5709-LVOEQ            80.85                     0
453   2775-SEFEE            61.90                     0
505   3115-CZMZD            20.25                     0
1293  7644-OMVMY            19.85                     0
726   4472-LVYGI            52.55                     0
716   4367-NUYAO            25.75                     0
428   2587-YNLES            20.10        100.35       6
1398  8219-VYBVI            25.00       1004.35      39
109   0621-CXBKL            18.70        1005.7      53
570   3472-QPRCH            25.25        1006.9      40
1248  7427-AUFPY            19.65        1008.7      54

In [9]:
df_clean = df[df.total_charges != ' ']

In [10]:
df_clean.total_charges = df_clean.total_charges.apply(float)

In [11]:
df.shape

(1695, 4)

In [12]:
df.describe()

       monthly_charges       tenure
count      1695.000000  1695.000000
mean         60.770413    56.735103
std          34.678865    18.209363
min          18.400000     0.000000
25%          24.025000    48.000000
50%          64.350000    64.000000
75%          90.450000    71.000000
max         118.750000    72.000000

### 3) End with a python file wrangle.py that contains the function, *wrangle_telco()*, that will acquire the data and return a dataframe cleaned with no missing values.

In [25]:
def wrangle_telco(df):
    for col in df.columns:
        #col.dytpes
        df.replace(r'^\s*$', np.nan, regex=True, inplace=True)
    return df
def drop_nulls(df):
    return df.dropna()
type(df.total_charges)

pandas.core.series.Series

In [26]:
df.shape

(1695, 4)

In [27]:
df_clean = wrangle_telco(df)
df_clean.total_charges = df_clean.total_charges.apply(float)

df_clean.sort_values('total_charges').tail(15)

     customer_id  monthly_charges  total_charges  tenure
1679  9924-JPRMC           118.20        8547.15      72
1504  8879-XUAHX           116.25        8564.75      71
1657  9788-HNGUT           116.95        8594.40      72
1649  9739-JLPQJ           117.50        8670.10      72
1271  7569-NMZYQ           118.75        8672.45      72
234   1371-DWPAZ            56.05            NaN       0
416   2520-SGTTA            20.00            NaN       0
453   2775-SEFEE            61.90            NaN       0
505   3115-CZMZD            20.25            NaN       0
524   3213-VVOLG            25.35            NaN       0
678   4075-WKNIU            73.35            NaN       0
716   4367-NUYAO            25.75            NaN       0
726   4472-LVYGI            52.55            NaN       0
941   5709-LVOEQ            80.85            NaN       0
1293  7644-OMVMY            19.85            NaN       0

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1695 entries, 0 to 1694
Data columns (total 4 columns):
customer_id        1695 non-null object
monthly_charges    1695 non-null float64
total_charges      1685 non-null float64
tenure             1695 non-null int64
dtypes: float64(2), int64(1), object(1)
memory usage: 53.0+ KB

In [29]:
df_clean = drop_nulls(df_clean)
df_clean.shape

(1685, 4)